[
  {
    "headline": "Taking A COVID Rapid Test? You May Want To Swab Your Nose And Throat.",
    "dek": "Swabbing both areas when using an at-home test might give more accurate results in certain cases. Here's why and how to do it.",
    "author": "Julia Ries",
    "time": "2022-01-01T07:00:00-0500",
    "contents": "You may have noticed that more and more people are testing positive for COVID-19 after using a rapid test to swab their throats. The trend took off on  Twitter  this past week, and unlike most of the medical advice shared across social media, this tactic appears to be scientifically sound.  Most of the rapid antigen tests available are currently only authorized for nasal collection, but infectious disease experts aren’t surprised to hear that people who tested negative after a nasal swab nonetheless test positive after swabbing their throats.  Though the rapid test kit manufacturers recommend using the tests only as instructed (in other words, only doing a nasal swab), growing anecdotal evidence suggests it might be worth safely swabbing both your throat and nose. And the general consensus among doctors is that it’s not a bad idea — especially if you have a sore throat.  Why swab your throat, too? According to  Andrew Noymer , an epidemiologist with the University of California, Irvine, respiratory viruses like SARS-CoV-2 can infect all parts of our respiratory tract, which is basically anything that brings air into your body — this includes your nose, throat, mouth, windpipe and lungs.  Although the nose and throat are both part of the upper respiratory system and closely connected, there may be some differences in the amount of virus in the nose versus the throat. Why this happens is unclear, but Noymer said it’s likely due to a mix of viral factors — like where and how the virus replicates — and human factors.  Some scientists suspect saliva (throat) swabs may be more useful for detecting omicron since the variant replicates more efficiently in the upper respiratory tract. A  pre-print study  from South Africa recently found that while PCR nasal swabs successfully detected all delta cases, they missed 14% of omicron cases — while a saliva swab caught all omicron cases. Amesh Adalja , a senior scholar at the Johns Hopkins University Center for Health Security and an infectious disease expert, said swabbing both your nose and your throat will actually increase the sensitivity of the tests and therefore improve the chances that they will detect the virus.  According to Adalja, this phenomenon occurs with other viruses, too, like influenza, rhinovirus and various adenoviruses. In fact, some flu viruses are more culturable in the throat than the nose.  “Most viruses replicate in both the nasopharynx and the oropharynx, which are anatomically contiguous, and they [cause] both nasal and throat symptoms,” Adalja said.  Purvi Parikh, an adult and pediatric allergist and immunologist with  Allergy & Asthma Network , said another reason a nasal swab might give a negative result while a throat swab comes back with a positive one is that many people don’t swab their noses correctly. You really need to swab deep enough in the sinuses to get an accurate result. Many viruses and bacteria drip down from the nose to the throat. They also shoot up from the lungs to the throat from coughing.  “A person may not get enough sample to detect virus if they do the nasal test incorrectly or do not go deep enough. Whereas if you have a sore throat, likely whatever is deep in your nose has dripped down the back of your throat,” Parikh said. Here’s how to properly swab your throat for COVID. Parikh recommends swabbing your throat when it first becomes sore. Her main tip: Swab your throat in addition to your nose, not in place of it. If you primarily have a sore throat, it makes sense to go for a throat swab, Adalja said. If your symptoms are predominately in your nasal passages, a nasal swab may be sufficient. “However, getting samples from both may be the best practice,” Adalja said. Avoid eating, drinking or using antiseptic mouthwash for 30 to 60 minutes prior to swabbing your throat, as this can impact how much virus can be collected, Parikh said. Think of it like a strep test — the further back in the throat you can reach, the more sensitive the test will be.  Lastly, keep in mind that while throat testing has always been an option for COVID-19, the rapid tests have been specifically designed and authorized as nasal swab devices. The over-the-counter test kits have not yet been officially tested or approved for throat swabbing — but, still, anecdotal data is worth exploring. “The FDA, and the manufacturers of the test kits, need to hop on this and start doing some studies,” Noymer said.  Experts are still learning about COVID-19. The information in this story is what was known or available as of publication, but guidance can change as scientists discover more about the virus. Please  check the Centers for Disease Control and Prevention  for the most updated recommendations.",
    "comments": []
  }
]
