[
{"label": "Politics", "headline": "Marine Corps Boots 206 Service Members Who Refused COVID Vaccines", "dek": "Overall, vaccine compliance is high among all branches of the military, despite early grumblings.", "author": "Mary Papenfuss", "time": "2022-01-02T23:19:47-0500", "contents": "The  U.S. Marine Corps  has discharged  206 service members  who defied the deadline to get vaccinated against COVID-19, officials have announced. Despite complaints and  early resistance from service members  over the COVID vaccine, however, compliance is generally high.  Overall, 95% of the more than 182,000 active duty Marines are  at least partially vaccinated . More than 1.9 million service members have either been  partially or fully vaccinated , according to the Department of Defense.  The Air Force, with a Nov. 2 vaccine deadline, discharged 27 people in mid-December for refusing to get inoculated against the coronavirus,  according to Military.com . Meanwhile, the Navy announced it would begin discharges for non-adherent members around the same time. The branch  had the same Nov. 28 vaccine deadline  as the Marine Corps for active duty personnel. Army officials  last month discharged  six active duty leaders , including two battalion commanders, and issued 2,767 written reprimands to soldiers for refusing the vaccination order. Officials aim to take further action this month against non-exempted individuals  who refuse to comply  with the vaccine requirements. Defense Secretary Lloyd Austin  mandated  COVID vaccinations for the military  in late August.  Last Tuesday, the Pentagon  announced  it is now also recommending a booster shot for all eligible troops and civilian members of the Defense Department. Nearly 100,000 active duty service members have already received boosters. The military hasn’t been spared from disruptions in operations due to the virus. In the last week of December, the USS Milwaukee Navy combat ship was  held up by a COVID outbreak . The ship docked at Guantanamo Bay after being forced to delay deployment to South America. Service members dismissed for vaccine refusal are protected from dishonorable discharge under the  2022 National Defense Authorization Act . ", "comments": []}
]