[
    {
        "label": "U.S. NEWS",
        "headline": "This Earth Day, Biden Faces 'Headwinds' On Climate Agenda",
        "dek": "President Joe Biden plans to mark Earth Day in Seattle on Friday, but he's struggled to make progress on a sweeping environmental agenda.",
        "author": "Matthew Daly and Chris Megerian",
        "time": "2022-04-21T03:42:17-0400",
        "contents": "WASHINGTON (AP) — One year ago, Joe Biden marked his first Earth Day as president by convening world leaders for a virtual summit on global warming that even Russian President Vladimir Putin and China’s Xi Jinping attended. Biden used the moment to nearly double the United States’ goal for reducing greenhouse gas emissions, vaulting the country to the front lines in the fight against climate change.",
        "comments": [
            {
                "name": "BlueEyed Wolf",
                "time": "April 22, 2022",
                "text": "How can we possibly make any significant inroads into saving the planet when we continue to add to the 7 billion humans already here. The number never stops growing, and that means needing cheap, pesticide filled food, beef, fuel and new land to farm and build on. You can't have both a sustainable planet with an unsustainable population of people.",
                "thumbs_up": "5",
                "thumbs_down": "0",
                "child": [
                    {
                        "name": "Robert Mecham",
                        "time": "April 22, 2022",
                        "text": "And what do you suppose we do to decrease the population.  A nice nuclear war might do the trick.",
                        "thumbs_up": "0",
                        "thumbs_down": "0",
                        "child": [
                            {
                                "name": "John Carlo",
                                "time": "April 22, 2022",
                                "text": "Education on a global scale to help humans evolve beyond believing reproduction is the only purpose for living, free birth control to all humans 14+, etc.\n\nInstead we have right wingers pushing reproduction for reason I don't understand, maybe a weird competitive thing which makes no sense, they'll never outbreed people in India, South America, etc.\n\nAnd progressives who claim to care about the planet yet with BBB prioritized essentially paying people to have more kids they can't afford which is the real reason Manchin opposed it.\n\nHe's on the record saying his opposition to BBB was because doesn't believe in the government paying people for nothing.\nPeople without kids got zero BBB benefits, it was all about childcare, child credits and payments, etc etc etc.\n\nManchin said drop the social welfare stuff and he'll vote for BBB....\nAnd the progressives refused, thus sacrificing the planet and what they claim to value while slandering Manchin over specious charges of fossil fuel corruption.\n\nIt's quite clear BBB wasn't being pushed to save the planet or reward responsible behavior. While lots of it was great, it was also an attempt to bribe the majority of 18-40 year olds for votes by paying them to have kids.\n\nin some regards, BBB was the least green piece of legislation ever.\n\nJust one new baby literally erases a lifetime of my sacrifices to be green. It's crazy to subsidize millions of new babies & immigrant babies who will need phones, cars, food, education, etc",
                                "thumbs_up": "1",
                                "thumbs_down": "0",
                                "child": []
                            },
                            {
                                "name": "Paul Deignan",
                                "time": "April 22, 2022",
                                "text": "If we don't do something soon, global warming will lower the population. Desertification, mass population relocation and the problems associated to name just a couple end results.",
                                "thumbs_up": "1",
                                "thumbs_down": "0",
                                "child": []
                            }
                        ]
                    },
                    {
                        "name": "Joseph Hinkle",
                        "time": "April 22, 2022",
                        "text": "What's your solution?",
                        "thumbs_up": "0",
                        "thumbs_down": "0",
                        "child": []
                    }
                ]
            },
            {
                "name": "rhoda ciraolo",
                "time": "April 21, 2022",
                "text": "If people knew what \"the powers that shouldn't be\" have planned and mapped out for the future, they would look at climate change with a different view.  Yes the environment needs cleaning up, but climate change is a tool being used for other purposes.  You will not find this info through MSM though.",
                "thumbs_up": "6",
                "thumbs_down": "0",
                "child": []
            },
            {
                "name": "Red Wave",
                "time": "April 21, 2022",
                "text": "Question: Which will happen first,  Biden's poll numbers or inflation reach 15%?",
                "thumbs_up": "15",
                "thumbs_down": "2",
                "child": [
                    {
                        "name": "American Patriot",
                        "time": "April 21, 2022",
                        "text": "Have you not been shopping for groceries and fuel?\n\nIt’s well beyond  15% YOY",
                        "thumbs_up": "4",
                        "thumbs_down": "0",
                        "child": []
                    },
                    {
                        "name": "Patrick Rowe",
                        "time": "April 21, 2022",
                        "text": "I'm betting it is your IQ that will win.",
                        "thumbs_up": "0",
                        "thumbs_down": "6",
                        "child": []
                    }
                ]
            },
            {
                "name": "Steve Evets",
                "time": "April 21, 2022",
                "text": "Stopping or even significantly slowing global climate change is today's lost cause--it's not going to happen. The nations of the world are not going to have a kumbaya moment and come together about it. It's far past time to begin preparing for the negative consequences of GCC.",
                "thumbs_up": "9",
                "thumbs_down": "2",
                "child": [
                    {
                        "name": "Unpopular Opinion",
                        "time": "April 22, 2022",
                        "text": "if everyone stopped driving and causing greenhouse gases, corporations would still be responsible for 70% of pollution today.",
                        "thumbs_up": "0",
                        "thumbs_down": "1",
                        "child": []
                    }
                ]
            },
            {
                "name": "Unpopular Opinion",
                "time": "April 22, 2022",
                "text": "Using our reserves instead of renewing gas and oil leases is like tapping your 401k instead of going to work. Brandon did that.",
                "thumbs_up": "12",
                "thumbs_down": "1",
                "child": [
                    {
                        "name": "John Morin",
                        "time": "April 22, 2022",
                        "text": "Child, oil companies are sitting on RECORD amount of oil leases already.  When asked in a hearing why oil companies aren't drilling more, the oil execs simply responded that it's more profitable to do nothing and charge a premium for oil.  \"\"Discipline continues to dominate the industry,\" an executive from an oilfield services firm told the Dallas Fed in the Survey\". https://www.dallasfed.org/research/surveys/des/2022/2201.aspx#tab-report \n \"Shareholders and lenders continue to demand a return on capital, and until it becomes unavoidably obvious that high energy prices will \nsustain, there will be no exploration spending.\"  \"Just 6% of executives polled by the Dallas Fed pointed to government \nregulations as the primary reason publicly-traded oil companies are restraining production growth.  Another 11% pointed to \nenvironmental, social and governance (ESG) issues. The ESG movement has led many investors to shy away from fossil fuel companies in favor of clean energy ones.  About 15% of executives said \"other\" factors were to blame, including personnel shortages and supply-chain problems.\" https://www.kmbc.com/article/gas-prices-oil-ceos-not-drilling-more/39528197#\n Mind you, drilling for more oil is like trying to put out a fire with gasoline.  In other words, monumentally stupid, especially since continuing on our current trajectory means the extinction of human race.",
                        "thumbs_up": "1",
                        "thumbs_down": "1",
                        "child": []
                    }
                ]
            },
            {
                "name": "guillermo piedras",
                "time": "April 22, 2022",
                "text": "His administration cancelled the pipeline, discouraged oil and gas drilling on federal lands (Bureau of Land Management just recently changed that) and all that impacted consumer costs. It also impacted fertilizer production, shortages of which in turn impacts food production. Food prices rose this year and will increase even more next year as the UN has warned. Most affected will be poorer countries where the poorest will likely try to migrate to Europe or America in search of something better. That perilous journey could cost them their lives. \nBut the Biden administration apparently has never had the intelligence to connect these related phenomena.",
                "thumbs_up": "3",
                "thumbs_down": "0",
                "child": [
                    {
                        "name": "danny johnson",
                        "time": "April 22, 2022",
                        "text": "You are correct.  And… most of the Biden administration have NEVER owned or operated a business, hence, they are clueless when it comes to related phenomenon.",
                        "thumbs_up": "3",
                        "thumbs_down": "1",
                        "child": []
                    },
                    {
                        "name": "D Steele",
                        "time": "April 22, 2022",
                        "text": "What would you do? Burn more oil?",
                        "thumbs_up": "0",
                        "thumbs_down": "1",
                        "child": [
                            {
                                "name": "guillermo piedras",
                                "time": "April 22, 2022",
                                "text": "Come up with substitution strategies before adopting ideology as the basis of your energy policies.",
                                "thumbs_up": "0",
                                "thumbs_down": "0",
                                "child": []
                            }
                        ]
                    }
                ]
            },
            {
                "name": "Lee Texas",
                "time": "April 21, 2022",
                "text": "The extreme poor have a small carbon footprint. Can you Progressives convince millions of Americans to choose to live that way and live by example?",
                "thumbs_up": "5",
                "thumbs_down": "0",
                "child": [
                    {
                        "name": "Paul Deignan",
                        "time": "April 21, 2022",
                        "text": "Don't know about progressives, but I've lived that way since the eco protests in the 70s. My career choice never got me above mid 40k/year, but I've lived a rich life.",
                        "thumbs_up": "4",
                        "thumbs_down": "1",
                        "child": [
                            {
                                "name": "Unpopular Opinion",
                                "time": "April 22, 2022",
                                "text": "your career choice never let you make more than $40k per year? what career path is that?",
                                "thumbs_up": "0",
                                "thumbs_down": "0",
                                "child": [
                                    {
                                        "name": "Paul Deignan",
                                        "time": "April 22, 2022",
                                        "text": "Forestry (technician), I say I've lived a rich life for my business office (wherever I was working that day) was located in places that people save just to visit. Living a low carbon lifestyle in a recreation meca.",
                                        "thumbs_up": "1",
                                        "thumbs_down": "0",
                                        "child": [
                                            {
                                                "name": "Unpopular Opinion",
                                                "time": "April 22, 2022",
                                                "text": "thats pretty cool. Sometimes the peace is worth the financial struggle. Not to say that you struggled, but you know.",
                                                "thumbs_up": "1",
                                                "thumbs_down": "0",
                                                "child": [
                                                    {
                                                        "name": "Paul Deignan",
                                                        "time": "April 22, 2022",
                                                        "text": "frugal besides, I own two properties and have a decent 401k",
                                                        "thumbs_up": "2",
                                                        "thumbs_down": "0",
                                                        "child": [
                                                            {
                                                                "name": "Unpopular Opinion",
                                                                "time": "April 22, 2022",
                                                                "text": "nice. good for you for living the good life.",
                                                                "thumbs_up": "0",
                                                                "thumbs_down": "0",
                                                                "child": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "name": "Lebron Deflopper",
                "time": "April 21, 2022",
                "text": "Biden admin admitted regulations and leasing ban effects price of gas \n\nWhich is something so many liberals denied for months .",
                "thumbs_up": "8",
                "thumbs_down": "0",
                "child": []
            },
            {
                "name": "Michael Anderson",
                "time": "April 21, 2022",
                "text": "The cooling that has happened from the end of winter to the spring is going to be hard to offset for the rest of the year",
                "thumbs_up": "4",
                "thumbs_down": "0",
                "child": [
                    {
                        "name": "Paul Deignan",
                        "time": "April 22, 2022",
                        "text": "Don't understand global do you?",
                        "thumbs_up": "0",
                        "thumbs_down": "0",
                        "child": [
                            {
                                "name": "Michael Anderson",
                                "time": "April 22, 2022",
                                "text": "Reading the stories about Ukraine , EU , Argentina and Japan tend to indicate it is global",
                                "thumbs_up": "0",
                                "thumbs_down": "0",
                                "child": [
                                    {
                                        "name": "Paul Deignan",
                                        "time": "April 22, 2022",
                                        "text": "Its the end of the summer in the southern hemisphere, it has already been offset. The cooling was in specific localities, not across the globe.",
                                        "thumbs_up": "0",
                                        "thumbs_down": "1",
                                        "child": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "name": "F1ns Fan",
                "time": "April 21, 2022",
                "text": "Biden is still in NC looking for someone to shake hands with….",
                "thumbs_up": "28",
                "thumbs_down": "3",
                "child": [
                    {
                        "name": "The Return of the Kang",
                        "time": "April 21, 2022",
                        "text": "No. He’s promoted the Easter Bunny to an advisor and is listening to him intently.",
                        "thumbs_up": "23",
                        "thumbs_down": "2",
                        "child": [
                            {
                                "name": "American Patriot",
                                "time": "April 22, 2022",
                                "text": "It it wasn’t a transgender Easter bunny!!!!",
                                "thumbs_up": "2",
                                "thumbs_down": "0",
                                "child": []
                            }
                        ]
                    },
                    {
                        "name": "gail M Braxton",
                        "time": "April 21, 2022",
                        "text": "And in NC an investigation into Mark Meadows voting in TWO states is ongoing, claiming to reside in NC Meadows voting is called Voter Fraud.  President Biden has better things to do then visit NC.",
                        "thumbs_up": "3",
                        "thumbs_down": "7",
                        "child": []
                    },
                    {
                        "name": "Ganesh Iyer",
                        "time": "April 21, 2022",
                        "text": "Trump is still in Florida looking for someone to pickpocket.",
                        "thumbs_up": "4",
                        "thumbs_down": "10",
                        "child": []
                    }
                ]
            },
            {
                "name": "john wick",
                "time": "April 21, 2022",
                "text": "The leasing plan \"is an ugly betrayal of Joe Biden’s campaign promises and his administration’s rhetoric on environmental justice and climate action,″ said Collin Rees, U.S. political director at Oil Change International.\n“Biden is choosing to stand with polluters over people at the expense of frontline communities and the future of the planet,\" he added.\n\n🤷🤣🤣🤣👍",
                "thumbs_up": "6",
                "thumbs_down": "0",
                "child": []
            },
            {
                "name": "John Carlo",
                "time": "April 22, 2022",
                "text": "Progressives claim to care about the planet yet BBB prioritized paying people to have kids they can't afford which is the real reason Manchin opposed it.\n\nHe's on record saying his opposition to BBB was because doesn't believe in the government paying people for nothing.\n\nPeople without kids got zero BBB benefits, it was all about childcare, child credits & payments, etc.\n\nManchin said drop the social welfare stuff & he'd vote for BBB.\n\nThe progressives refused, thus sacrificing the planet & green new deal while slandering Manchin over specious charges of fossil fuel corruption.\n\nIt's clear BBB wasn't being pushed to save the planet or reward responsible behavior.\n\nSure, lots of it was great but it was also an attempt to bribe the majority of 18-40 year olds for votes by paying them to have kids, hooking them on subsidizes to use every election against the GOP.\n\nIn some regards, BBB was the least green piece of legislation ever. Just one new baby literally erases a lifetime of my sacrifices to be green.\n\nIt's crazy to subsidize millions of new babies & push for more immigrants who reproduce twice as much as Americans. \n\nEvery new baby will need 85 years worth of phones, cars, food, sewage treatment, energy, education, etc, devastating the planets carrying capacity.\n\nThere's no way to outrun & innovate our way to sustaining nearly a billion new humans every decade.\n\nBBB should've offered everyone over 55 WO kids $750K, it would cost less than more babies over their lifetime.",
                "thumbs_up": "2",
                "thumbs_down": "0",
                "child": []
            },
            {
                "name": "Wild Bill",
                "time": "April 21, 2022",
                "text": "Until there is a way to profit from saving the planet, there is little hope until the casualties and devestation begin to cost more than what can be gained. Our country is sick and there is no cure when our representatives and big business care more about immediate gains than a healthy future.",
                "thumbs_up": "9",
                "thumbs_down": "10",
                "child": [
                    {
                        "name": "The Return of the Kang",
                        "time": "April 21, 2022",
                        "text": "Just reach out to Al Gore for advice.  He profited immensely from “saving” the planet.🤣",
                        "thumbs_up": "24",
                        "thumbs_down": "5",
                        "child": [
                            {
                                "name": "Walt Kowalski",
                                "time": "April 21, 2022",
                                "text": "and so does everyone pushing this nonsense.",
                                "thumbs_up": "3",
                                "thumbs_down": "2",
                                "child": []
                            }
                        ]
                    }
                ]
            },
            {
                "name": "Martin Sandberg",
                "time": "April 21, 2022",
                "text": "Preventing this administration from causing damage for no reason is a good thing! \n\n\"A year ago, I warned that there was great risk in using computer modelling and immature science to make extraordinary claims. The empirical observations I have reviewed show very gentle warming and no evidence of a climate crisis.”\nGWPF director, Dr Benny Peiser said:\n“It’s extraordinary that anyone should think there is a climate crisis. Year after year our annual assessment of climate trends document just how little has been changing in the last 30 years. The habitual climate alarmism is mainly driven by scientists’ computer modelling rather than observational evidence.”\nAs usual, I put a long enough quote in so that you can find the Climate Depot article with an unbiased search engine. Google's wrecked theirs, so it can't find it.",
                "thumbs_up": "7",
                "thumbs_down": "5",
                "child": [
                    {
                        "name": "Paul Deignan",
                        "time": "April 21, 2022",
                        "text": "Little change over 30 years, way too short a time span for any reliable study on climate. That isn't even long enough for a good study on weather. Climatically speaking, 30 years is less than a nanosecond.\n\nand by the way, all it takes is little global temperature change to make massive variations. We have little idea of what these changes will bring about. Reduction of glacial mass will cause isostatic rebound, what's that going to do along the \"ring of fire\"? While all that weight is being removed from landmasses, it is accumulating in the oceans, will this bring about more severe earthquakes and volcanic activity from weight transferred to different tectonic plates? Increased acidification of our oceans, desertification of our land areas, these are happening with the little variation we've already caused (yes, we've caused), we need to act.\nWhen looking at things scientifically, there are papers that will seem to contradict majority findings but read beyond the summation and find timeframe and extent of data the findings are based on. Scientific conclusions are based on preponderance of evidence and scientific majority of people of the associated field. In this case, undeniable preponderance and overwhelming majority.",
                        "thumbs_up": "4",
                        "thumbs_down": "1",
                        "child": [
                            {
                                "name": "Jonjo Jonjo",
                                "time": "April 21, 2022",
                                "text": "Based on this statement \"Scientific conclusions are based on preponderance of evidence and scientific majority of people of the associated field. In this case, undeniable preponderance and overwhelming majority.\" you are 100% wrong. The majority of those studying climate still think that the jury is out. There is a lot of evidence that is is not man made but quite possibly man enhanced. That it is 100% natural but some of man's actions are making it worse but we are not sure. We just do not know to what degree that our actions are making enhancing the effects of natural change, or if at all.\n\nYou obviously slept through the important parts of school or were not educated at all.",
                                "thumbs_up": "3",
                                "thumbs_down": "0",
                                "child": [
                                    {
                                        "name": "Paul Deignan",
                                        "time": "April 21, 2022",
                                        "text": "Made, enhanced.\nSemantics\n\ndepends on the side you're trying to support.\n\nI did sleep through a lot of my high school classes, for I had a full time job after school. Fellow students accused me of cheating for I had the highest test averages, I asked them who I could be cheating from? You obviously were the student who could listen, but not absorb.",
                                        "thumbs_up": "1",
                                        "thumbs_down": "1",
                                        "child": []
                                    },
                                    {
                                        "name": "Paul Deignan",
                                        "time": "April 21, 2022",
                                        "text": "type in your search engine\n\"scientific consensus on climate change\"\nYou'll find out you're wrong, for at least the last decade.",
                                        "thumbs_up": "1",
                                        "thumbs_down": "0",
                                        "child": []
                                    }
                                ]
                            },
                            {
                                "name": "Martin Sandberg",
                                "time": "April 21, 2022",
                                "text": "There is more than 30 years of fairly good data, of course. After warming from the little ice age starting at about 1850 the cooling from about 1940 - 1970, the last 30 years have been remarkably constant.\n\nThe point is that the models cannot support policies that will cost trillions of dollars. The data isn't there to support those policies either.",
                                "thumbs_up": "2",
                                "thumbs_down": "1",
                                "child": [
                                    {
                                        "name": "Paul Deignan",
                                        "time": "April 21, 2022",
                                        "text": "Modeling is a prediction, a great model is considered ~70% reliable, a good tool, but not a stand alone conclusion. I don't trust any single model, but when different models predict basically the same kind of result (with degrees of variability), the conclusions over time become accepted.\nIf you noticed by my reply, there are more questions than answers for each % of a degree increase, adds risk factors and variables.",
                                        "thumbs_up": "2",
                                        "thumbs_down": "1",
                                        "child": [
                                            {
                                                "name": "Martin Sandberg",
                                                "time": "April 21, 2022",
                                                "text": "The models don't work. Again a long quote from Ed Zuiderwijk, PhD:\n\n\"There is something strange about climate models: they don’t converge. What I mean by that I will explain on the basis of historical determinations of what we now call the ‘Equilibrium Climate Sensitivity’ (ECS), also called the ‘Charney Sensitivity’ (ref 1), defined as the increase in temperature at the bottom of the Earth’s atmosphere when the CO2 content is doubled (after all feedbacks have worked themselves through). The early models by Plass (2), Manabe & co-workers (3) and Rowntree & Walker (4) in the 1950s, 60s and 70s gave ECS values from 2 degrees Centigrade to more than 4C. Over the past decades, these models have grown into a collection of more than 30 climate models brought together in the CMIP6 ensemble that forms the basis for the upcoming AR6 (‘6th Assessment Report’) of the IPCC. However the ECS values still cover the interval 1.8C to 5.6C, a factor of 3 difference in results. So after some 4 decades of development climate models have still not converged to a ‘standard climate model’ with an unambiguous ECS value; rather the opposite is the case.\" \n\nThe whole article is well worth reading.",
                                                "thumbs_up": "0",
                                                "thumbs_down": "0",
                                                "child": [
                                                    {
                                                        "name": "Paul Deignan",
                                                        "time": "April 21, 2022",
                                                        "text": "A standard climate model would require the same input variables, historic data sets that climate is based upon are not available across study areas (ice cores in some areas, lakebed samples in others (tree rings for better short term (last 1000 years) data)), so input variables cannot be standardized. Range of variability in studies is based in the scientist's preconceived theory, the input variables the scientist(s) feel are relevant and reliable, and where the data shows statistical significance. Mathematically/scientifically reliability of available data sets varies for long term historic data so convergence on a single (standardized) method is basically impossible.",
                                                        "thumbs_up": "0",
                                                        "thumbs_down": "0",
                                                        "child": [
                                                            {
                                                                "name": "Martin Sandberg",
                                                                "time": "April 22, 2022",
                                                                "text": "Exactly! From further down in Ed Zuiderwijk's paper:\n\n\"If the astrophysicists were in the same situation as the climate model makers, they would still be working with, for example, a series of solar models that predict a value of X for the surface temperature give or take a few thousand degrees. Or that, in an engineering application, a new aircraft design should have a wing area of Y, but it could also be 3Y. You don’t have to be a genius to understand that such models are not credible.\"\n\nThat's why we cannot make policies that will cost trillions based on the models.",
                                                                "thumbs_up": "0",
                                                                "thumbs_down": "0",
                                                                "child": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    },
                                    {
                                        "name": "Paul Deignan",
                                        "time": "April 22, 2022",
                                        "text": "Your reply saying that the models are not creditable hasn't shown up for me to directly reply to, so I'll do it here.\nJust because models aren't standardized doesn't make them not creditable, they are based on statistical math.\nMath doesn't lie.",
                                        "thumbs_up": "1",
                                        "thumbs_down": "0",
                                        "child": []
                                    }
                                ]
                            },
                            {
                                "name": "American Patriot",
                                "time": "April 21, 2022",
                                "text": "Guess the climate freaks will need to stop yelling \n“In 20 years youll all be dead”",
                                "thumbs_up": "1",
                                "thumbs_down": "0",
                                "child": [
                                    {
                                        "name": "Paul Deignan",
                                        "time": "April 22, 2022",
                                        "text": "I will be by then if family history and genetic traits play out.",
                                        "thumbs_up": "0",
                                        "thumbs_down": "0",
                                        "child": [
                                            {
                                                "name": "American Patriot",
                                                "time": "April 22, 2022",
                                                "text": "That makes two of us",
                                                "thumbs_up": "0",
                                                "thumbs_down": "0",
                                                "child": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "name": "David Baxter",
                        "time": "April 21, 2022",
                        "text": "Why not tell people who the \"GWPF\" are.    A quick Google search will explain that the Global Warming Policy Foundation are a wholly owned subsiduary of the original GWPF, that was registered as a \"charity\" in the UK.     It was created because the \"charity\" lost its charitable status after being found guilty of unlawful bias.   It is currently a fringe organization of Climate-Deniers (~120 members),  and lost their charitable status because they   \"persistently disseminated inaccurate and misleading information about climate change as part of its campaign against climate policies in the UK and overseas\".\n\nBut you can believe them if your want.",
                        "thumbs_up": "0",
                        "thumbs_down": "0",
                        "child": [
                            {
                                "name": "Martin Sandberg",
                                "time": "April 22, 2022",
                                "text": "So what? Are their papers true?\n\nBy your standards, Albert Einsteins early work should have been ignored because he was just a patent clerk.",
                                "thumbs_up": "0",
                                "thumbs_down": "0",
                                "child": []
                            },
                            {
                                "name": "American Patriot",
                                "time": "April 21, 2022",
                                "text": "Why is it that with the satanic left anything that runs counter to your false narrative is fake information\n\nThe whole world is watching you make fools of yourselves and you don’t even em realize it \n\nDelicious",
                                "thumbs_up": "2",
                                "thumbs_down": "0",
                                "child": [
                                    {
                                        "name": "David Baxter",
                                        "time": "April 22, 2022",
                                        "text": "Is that all you got ??    Name calling ??   Get back under the rock.",
                                        "thumbs_up": "0",
                                        "thumbs_down": "0",
                                        "child": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "name": "danny johnson",
                "time": "April 21, 2022",
                "text": "If the oceans were really gonna rise… I doubt banks would still be making 30 year mortgages on ocean front property… And I doubt Obama and Biden would be buying ocean front mansions.  \n🙄🙄",
                "thumbs_up": "5",
                "thumbs_down": "0",
                "child": [
                    {
                        "name": "Paul Deignan",
                        "time": "April 21, 2022",
                        "text": "As long as there's a market and money to be made, capitalism will continue. Oceans are rising, why do you think some states are looking at Netherland style flood gates? My fellow Americans seems willing to invest to try to control the results of non-action but unwilling to mitigate.",
                        "thumbs_up": "2",
                        "thumbs_down": "2",
                        "child": [
                            {
                                "name": "paul simmons",
                                "time": "April 22, 2022",
                                "text": "It’s true. Oceans are rising, on average about 1/4 inch per year, as they have been doing for the past 15000 years.",
                                "thumbs_up": "4",
                                "thumbs_down": "0",
                                "child": [
                                    {
                                        "name": "Paul Deignan",
                                        "time": "April 22, 2022",
                                        "text": "Average yes, but look at the incline variation starting to increase as the industrial revolution began, you can't miss it, unless you are purposefully not looking..",
                                        "thumbs_up": "1",
                                        "thumbs_down": "2",
                                        "child": []
                                    }
                                ]
                            },
                            {
                                "name": "danny johnson",
                                "time": "April 21, 2022",
                                "text": "Nope… if the banks KNEW the oceans were going to rise, they would not be making 30 year gambles.   And the Obama’s should be bailing outta their new mansion.  \nBut… since you are a gullible lib… you buy it all… hook line and sinker.",
                                "thumbs_up": "2",
                                "thumbs_down": "0",
                                "child": [
                                    {
                                        "name": "Paul Deignan",
                                        "time": "April 22, 2022",
                                        "text": "What a short memory you have, do you remember the housing bubble?",
                                        "thumbs_up": "0",
                                        "thumbs_down": "0",
                                        "child": [
                                            {
                                                "name": "danny johnson",
                                                "time": "April 22, 2022",
                                                "text": "Yep… I bought 8 more houses when the bubble went pop.",
                                                "thumbs_up": "0",
                                                "thumbs_down": "0",
                                                "child": [
                                                    {
                                                        "name": "Paul Deignan",
                                                        "time": "April 22, 2022",
                                                        "text": "Then you took advantage of a bank gamble that didn't pay off. Talk about me being gullible when your comments contradict each other with my one sentence reply. Banks will invest as long as they can make a buck, they make more than their money back before the loan is half over.\nBanks can make mistakes too.",
                                                        "thumbs_up": "0",
                                                        "thumbs_down": "0",
                                                        "child": [
                                                            {
                                                                "name": "danny johnson",
                                                                "time": "April 22, 2022",
                                                                "text": "Come on … you think banks don’t have a eye on reality ?  You don’t think they study the HELL outta the future ?Especially on multi million dollar beach front properties.  MORE than other type properties.   They wouldn’t be giving out 4% mortgages for 30 years if they thought the oceans were gonna rise and flood and destroy their long term investments. Wake up dude.  \n🙄",
                                                                "thumbs_up": "0",
                                                                "thumbs_down": "0",
                                                                "child": [
                                                                    {
                                                                        "name": "Paul Deignan",
                                                                        "time": "April 22, 2022",
                                                                        "text": "It's called profit/risk analysis, they feel they can make money before the value crashes. You think government isn't going to assist landowners along coastlines under blanket policy where the risk will be lowered? You really don't get the big picture do you? If they do ending up losing out on their investments, the \"to big to fail\" major mortgage holders will be bailed out, again, by us taxpayers.\nLike you said,\nwake up dude.",
                                                                        "thumbs_up": "0",
                                                                        "thumbs_down": "0",
                                                                        "child": [
                                                                            {
                                                                                "name": "danny johnson",
                                                                                "time": "April 22, 2022",
                                                                                "text": "Lighten up\nLucy. Read the article.",
                                                                                "thumbs_up": "0",
                                                                                "thumbs_down": "0",
                                                                                "child": []
                                                                            },
                                                                            {
                                                                                "name": "danny johnson",
                                                                                "time": "April 22, 2022",
                                                                                "text": "Lol\nYou have bought in so deep… may not be any help for you available.  😂",
                                                                                "thumbs_up": "0",
                                                                                "thumbs_down": "0",
                                                                                "child": []
                                                                            }
                                                                        ]
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "name": "John Carlo",
                        "time": "April 22, 2022",
                        "text": "Did you miss the collective behavior of the folks who fueled the 08 housing crash and global recession?\n\nPeople working in lending get paid upfront via fees, commissions, etc.\n\nIf things fall apart long after they've been paid & retired wealthy, it doesn't matter; their incentives are to produce in the NOW. It's a problem today's 10 yr kids will have to deal with in a couple decades.\n\nI always hear how great it is to let young people run things but I disagree; the young are the most naive group around who believe nothing happened before they paid attention....  so in their ego driven push to make their mark they keep repeating the same mistakes folks in the past made.\n\nEvolution requires building upon established facts, not starting over again and again everytime a new generation's ego deludes them into thinking they know something the rest of us don't, like a kid who points at a cloud thinking they discovered it and want me to discover it too.\n\nThat why the anti-American, racist & anti-personal responsibility woke are going to lose elections & put the GOP in power for the next decade.",
                        "thumbs_up": "0",
                        "thumbs_down": "0",
                        "child": []
                    }
                ]
            },
            {
                "name": "Where's Jackie?",
                "time": "April 21, 2022",
                "text": "In elementary school in the 70s we were taught the ozone layer would dissappear and we'd all toast like marshmallows.  What happened?",
                "thumbs_up": "4",
                "thumbs_down": "1",
                "child": []
            },
            {
                "name": "Jason Nichols",
                "time": "April 21, 2022",
                "text": "Climate change is solved.\nThe science has proven that nuclear power and natural gas have enabled a carbon-neutral world, the left is just blocking them so they can keep using fear to push their socialist agenda.",
                "thumbs_up": "20",
                "thumbs_down": "12",
                "child": [
                    {
                        "name": "Walt Kowalski",
                        "time": "April 21, 2022",
                        "text": "They'll block anything that works therefore inhibiting their agenda. This is about control. Period!",
                        "thumbs_up": "3",
                        "thumbs_down": "2",
                        "child": []
                    }
                ]
            },
            {
                "name": "Joseph Scott",
                "time": "April 22, 2022",
                "text": "There was always a slim to none chance that the monstrous BBB was going to be enacted into law. It was an FDR New Deal in its ambitions in a political climate that saw nothing like the mandate at the ballot box that Democrats and FDR received in 1932. The Democrats (especially “progressive” Democrats) need to decide just how big a priority doing what is practically possible to mitigate future global warming really is for them. That's versus other economic and social agendas.\n\nWhat can be done needs to acknowledge a few realities. Global warming caused by carbon dioxide [as well as methane, . . .] is a global problem. It does not matter where the emission occurs. It doesn't matter how or why. It does not matter who. Just how much globally each year. Solutions must deal with the existing reality that over the 20th century and now into the 21st one primate species has in a relative comparison exhibited a bacterial rate of population growth relative to every other primate species. This while growing use to a life style that can only be supported with existing emission rates. How much reduction in quality of life are 330 million people in the US willing to accept (especially those who are not young, healthy, and living in urban areas) to even break even with the increase in emissions that the 1.38 billion [in India alone] want if they are going to achieve anything like the quality of life that will exist in the US?",
                "thumbs_up": "1",
                "thumbs_down": "0",
                "child": []
            },
            {
                "name": "Unpopular Opinion",
                "time": "April 22, 2022",
                "text": "Do you want cheap gas or green energy? you can't have both apparently. Biden opened up new gas and oil leases to start drilling at home again, so gas will go back down in the next few months. Depending on how many leases he allows, will determine how much gas goes down. Not a big story in the media about Biden changing his stance to Drill baby Drill!",
                "thumbs_up": "2",
                "thumbs_down": "0",
                "child": [
                    {
                        "name": "waterskidude F",
                        "time": "April 22, 2022",
                        "text": "he had to... suit against his shutting it down by exec order that they lost.. a Judge said he had to open it back up",
                        "thumbs_up": "2",
                        "thumbs_down": "1",
                        "child": []
                    }
                ]
            },
            {
                "name": "Topper Harley",
                "time": "April 21, 2022",
                "text": "Can we pay an extra tax to avoid Covid?\n\nOr does that only work with climate change?",
                "thumbs_up": "7",
                "thumbs_down": "2",
                "child": [
                    {
                        "name": "Patrick Rowe",
                        "time": "April 21, 2022",
                        "text": "You would think you could post something intelligent once out of your hundreds of posts. Guess not.",
                        "thumbs_up": "1",
                        "thumbs_down": "0",
                        "child": [
                            {
                                "name": "Topper Harley",
                                "time": "April 21, 2022",
                                "text": "Getting a response out of you is all I care about. 😁",
                                "thumbs_up": "0",
                                "thumbs_down": "0",
                                "child": [
                                    {
                                        "name": "Patrick Rowe",
                                        "time": "April 22, 2022",
                                        "text": "In other words, you are an empty suit.  Sad little man.",
                                        "thumbs_up": "0",
                                        "thumbs_down": "0",
                                        "child": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "name": "David Baxter",
                "time": "April 21, 2022",
                "text": "Anyone who opposes environmental efforts to fight climate change needs to explain it to their children and grandchildren.   The world that we have been destroying for the past 100 years is the only one we have, and our children and grandchildren are going to have to survive on it.     \n\nIt truly astounds me the way people glibly say, \"oh, the world has been through this before, and survived, so we can survive this.\"   First of all, \"We\" won't survive this.    If you are over 40, it is highly likely that this will lead to the end for us.     It is our children and grandchildren who will have to solve the problem of how to survive it.\n\nSecondly, why should we have to \"Survive\" this, when a few simple actions, which right now, are nothing more than a nuisance, would stop the problem from getting worse, and maybe even stop it from becoming life-threatening.\n\nSo, if you love your children, and your grand-children, as I do, then you need to get behind this push.    After all, it is only being driven by big corporations who are desperate to maintain their ridiculous profit margins.\n\nIf you really don't believe in climate change, or are not prepared to make the small changes require to alleviate it, or even perhaps solve it, then at least be honest with your children and tell them that \"... you don't give a fuq about their future, and that your politics and 401K are much more important.",
                "thumbs_up": "2",
                "thumbs_down": "1",
                "child": [
                    {
                        "name": "Where's Jackie?",
                        "time": "April 22, 2022",
                        "text": "I'll sign up when Russia, China, India and South America do. Why do democrats think America alone can change the climate of a planet 🤔.  Think about it.",
                        "thumbs_up": "4",
                        "thumbs_down": "0",
                        "child": [
                            {
                                "name": "Tim Messina",
                                "time": "April 22, 2022",
                                "text": "He won’t…",
                                "thumbs_up": "1",
                                "thumbs_down": "0",
                                "child": []
                            }
                        ]
                    },
                    {
                        "name": "paul simmons",
                        "time": "April 22, 2022",
                        "text": "Why would you ruin your grandchildren’s childhoods by infecting them with your paranoia. You must be Grandpa Downer.",
                        "thumbs_up": "5",
                        "thumbs_down": "0",
                        "child": [
                            {
                                "name": "Tim Messina",
                                "time": "April 22, 2022",
                                "text": "Because he is insane.",
                                "thumbs_up": "0",
                                "thumbs_down": "0",
                                "child": []
                            }
                        ]
                    },
                    {
                        "name": "Tom Bigley",
                        "time": "April 22, 2022",
                        "text": "Man made global warming is a scam designed to transfer wealth from America to elsewhere, and will have zero effect on the planet or it's population. Pollution, on the other hand, will eventually kill us all. Plastics, chemicals and fertilizers have already done untold damage, and in a century who knows how awful it will be.",
                        "thumbs_up": "0",
                        "thumbs_down": "0",
                        "child": []
                    },
                    {
                        "name": "Tim Messina",
                        "time": "April 22, 2022",
                        "text": "If you shut your mouth that should bring the temperature down a degree or two.",
                        "thumbs_up": "0",
                        "thumbs_down": "0",
                        "child": []
                    }
                ]
            },
            {
                "name": "Alan DeVane",
                "time": "April 21, 2022",
                "text": "The American voter does not give a crap about climate change ---- if they did -- Inslee or Steyer would have been nominated during the '20 primary.",
                "thumbs_up": "6",
                "thumbs_down": "0",
                "child": [
                    {
                        "name": "Perry Logan",
                        "time": "April 21, 2022",
                        "text": "https://www.pewresearch.org/science/2020/06/23/two-thirds-of-americans-think-government-should-do-more-on-climate/",
                        "thumbs_up": "1",
                        "thumbs_down": "2",
                        "child": [
                            {
                                "name": "Patrick Connors",
                                "time": "April 21, 2022",
                                "text": "No chance that’s true. Voting records say otherwise",
                                "thumbs_up": "1",
                                "thumbs_down": "0",
                                "child": [
                                    {
                                        "name": "Perry Logan",
                                        "time": "April 21, 2022",
                                        "text": "Here's another poll.\nhttps://apnews.com/article/climate-joe-biden-science-environment-and-nature-only-on-ap-1e48e3315d2e0b618ccaa4a8d466e057",
                                        "thumbs_up": "1",
                                        "thumbs_down": "0",
                                        "child": [
                                            {
                                                "name": "Patrick Connors",
                                                "time": "April 21, 2022",
                                                "text": "5400 people huh? Until these polls release where they’re pulling from, I’ll never believe any of them. Especially when it comes to climate change when nobody at the water cooler is discussing it",
                                                "thumbs_up": "0",
                                                "thumbs_down": "0",
                                                "child": [
                                                    {
                                                        "name": "Perry Logan",
                                                        "time": "April 21, 2022",
                                                        "text": "And another poll.\nhttps://news.gallup.com/poll/232007/americans-want-government-more-environment.aspx",
                                                        "thumbs_up": "1",
                                                        "thumbs_down": "0",
                                                        "child": [
                                                            {
                                                                "name": "Patrick Connors",
                                                                "time": "April 21, 2022",
                                                                "text": "I’m also one of those people who poses as a Bernie Sanders supporter when pollsters call me. You do know that polls are to shape public opinion and not reflect it right?",
                                                                "thumbs_up": "0",
                                                                "thumbs_down": "0",
                                                                "child": [
                                                                    {
                                                                        "name": "Perry Logan",
                                                                        "time": "April 22, 2022",
                                                                        "text": "That's another unsupported statement. Where's your evidence that the polls are all manipulative?",
                                                                        "thumbs_up": "0",
                                                                        "thumbs_down": "0",
                                                                        "child": [
                                                                            {
                                                                                "name": "Paul Deignan",
                                                                                "time": "April 22, 2022",
                                                                                "text": "He also never cites anything to support his conclusion besides voter records like it is an accurate comparison when over 1/2 the population vote only on political party.",
                                                                                "thumbs_up": "1",
                                                                                "thumbs_down": "0",
                                                                                "child": []
                                                                            }
                                                                        ]
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "name": "Where's Jackie?",
                                "time": "April 21, 2022",
                                "text": "Yeah , it's the main conversation at work,  the barber and restaurants and bars 🤣🤣",
                                "thumbs_up": "0",
                                "thumbs_down": "0",
                                "child": []
                            }
                        ]
                    }
                ]
            },
            {
                "name": "Todd Howell",
                "time": "April 21, 2022",
                "text": "Poor Joe, facingthehedwinds but the vindictive msm only focuses  on his Tail winds; oops Hadid it again.",
                "thumbs_up": "12",
                "thumbs_down": "3",
                "child": [
                    {
                        "name": "Paul Talmage",
                        "time": "April 21, 2022",
                        "text": "Well it is official, Biden has surpassed Carter as the worst president of our economy and to think he did it in just 1 1/2 years. Now that is incompetence one can be proud of.",
                        "thumbs_up": "3",
                        "thumbs_down": "1",
                        "child": [
                            {
                                "name": "American Patriot",
                                "time": "April 22, 2022",
                                "text": "Hell no\nIncompetence yes but this is all by design\nRemember that he is surrounded and controlled by a cadre of advisors….who as a collective could not possibly be this stupid even for card carrying commies\n\nAll by design",
                                "thumbs_up": "1",
                                "thumbs_down": "0",
                                "child": [
                                    {
                                        "name": "Paul Talmage",
                                        "time": "April 22, 2022",
                                        "text": "Sadly I think you are right.",
                                        "thumbs_up": "0",
                                        "thumbs_down": "0",
                                        "child": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "name": "gail M Braxton",
                        "time": "April 21, 2022",
                        "text": "Grow up",
                        "thumbs_up": "3",
                        "thumbs_down": "8",
                        "child": []
                    }
                ]
            },
            {
                "name": "Dave Weinberger",
                "time": "April 21, 2022",
                "text": "Here’s an update idea. Don’t fly all the way across the country to read a teleprompter. Make your statement from the White House",
                "thumbs_up": "3",
                "thumbs_down": "0",
                "child": [
                    {
                        "name": "American Patriot",
                        "time": "April 21, 2022",
                        "text": "Hasn’t been in the White House though",
                        "thumbs_up": "0",
                        "thumbs_down": "0",
                        "child": [
                            {
                                "name": "Dave Weinberger",
                                "time": "April 21, 2022",
                                "text": "He’s there four days a week. I wonder if on the way back from Seattle is he going to Delaware?",
                                "thumbs_up": "0",
                                "thumbs_down": "0",
                                "child": []
                            }
                        ]
                    },
                    {
                        "name": "edge 1452",
                        "time": "April 21, 2022",
                        "text": "Gotta \"press the flesh\"",
                        "thumbs_up": "0",
                        "thumbs_down": "0",
                        "child": [
                            {
                                "name": "Dave Weinberger",
                                "time": "April 21, 2022",
                                "text": "No one wants to press his flesh. When campaigning begins, Biden won’t be welcome anywhere",
                                "thumbs_up": "2",
                                "thumbs_down": "0",
                                "child": []
                            }
                        ]
                    }
                ]
            },
            {
                "name": "Mark Allen",
                "time": "April 21, 2022",
                "text": "The American people cannot just look to the government to solve this problem.  Climate change means lifestyle changes.  People have a multitude of opportunities to effect change.  Electric cars are more common, solar and wind energy are more available, we can eat less meat, walk and bike more.    \n\nWe can also elect people that support taking action.  Putting this all on the President head is silly.  He is dealing with the political realities.  If people lead the government will follow, if people just expect the government to do it all they will get nothing.",
                "thumbs_up": "2",
                "thumbs_down": "3",
                "child": [
                    {
                        "name": "Tom Bigley",
                        "time": "April 22, 2022",
                        "text": "If you really believe that all you said will change the planet's weather, then I feel sorry for you.",
                        "thumbs_up": "0",
                        "thumbs_down": "0",
                        "child": []
                    }
                ]
            },
            {
                "name": "The Return of the Kang",
                "time": "April 21, 2022",
                "text": "Feed the climate change beast, Leftist minions. It’s hunger for cash can never be satiated😂",
                "thumbs_up": "19",
                "thumbs_down": "4",
                "child": [
                    {
                        "name": "Joe Schmoe",
                        "time": "April 21, 2022",
                        "text": "Exxon, alone, clears $140M in profit every day.\nSaying \"follow the money\" leads to the scientists is not only wrong, it is absurd.\nThe Koch Bros. deeply appreciate your gullibility.",
                        "thumbs_up": "4",
                        "thumbs_down": "14",
                        "child": [
                            {
                                "name": "Dan Brown",
                                "time": "April 21, 2022",
                                "text": "Do you understand that Exxon (and oil companies in general) provide an absolutely essential product to the entire world and without it you would starve to death?",
                                "thumbs_up": "7",
                                "thumbs_down": "3",
                                "child": [
                                    {
                                        "name": "Joe Schmoe",
                                        "time": "April 21, 2022",
                                        "text": "The science behind global warming, or the documented efforts of the petroleum industry to fool people like you over the last 40 years will not fit in this comment box.\nGet a few clues.",
                                        "thumbs_up": "3",
                                        "thumbs_down": "5",
                                        "child": [
                                            {
                                                "name": "Walt Kowalski",
                                                "time": "April 21, 2022",
                                                "text": "\"Documented efforts\" .... Now do the one's on your side, caught red handed manipulating the data.",
                                                "thumbs_up": "1",
                                                "thumbs_down": "0",
                                                "child": [
                                                    {
                                                        "name": "Joe Schmoe",
                                                        "time": "April 22, 2022",
                                                        "text": "That's part of that 40 year disinformation campaign.\nIt didn't happen.\nYou've been played.",
                                                        "thumbs_up": "0",
                                                        "thumbs_down": "0",
                                                        "child": []
                                                    }
                                                ]
                                            }
                                        ]
                                    },
                                    {
                                        "name": "HUCK LEEDS",
                                        "time": "April 21, 2022",
                                        "text": "https://images.spot.im/image/upload/q_70,fl_lossy,dpr_3,h_174,w_236,c_limit/v200/41e459593a3008a90d5425e727ec2d45",
                                        "thumbs_up": "0",
                                        "thumbs_down": "0",
                                        "child": [
                                            {
                                                "name": "Dan Brown",
                                                "time": "April 24, 2022",
                                                "text": "You'll still starve to death without oil.",
                                                "thumbs_up": "0",
                                                "thumbs_down": "0",
                                                "child": []
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "name": "The Return of the Kang",
                                "time": "April 21, 2022",
                                "text": "They provide a product that consumers need and use... Even rabid Earth-savers, such as yourself, Schmoe.",
                                "thumbs_up": "0",
                                "thumbs_down": "0",
                                "child": []
                            }
                        ]
                    },
                    {
                        "name": "Mark Adkins",
                        "time": "April 21, 2022",
                        "text": "Why do conservatives hate their grandkids and want to leave them a ruined world?",
                        "thumbs_up": "4",
                        "thumbs_down": "14",
                        "child": [
                            {
                                "name": "The Return of the Kang",
                                "time": "April 21, 2022",
                                "text": "We love our grandkids. That's why we teach them about firearms, so that they can protect themselves from actual threats like the ever growing black crime-wave, Mark.🙂",
                                "thumbs_up": "9",
                                "thumbs_down": "3",
                                "child": [
                                    {
                                        "name": "Mark Adkins",
                                        "time": "April 21, 2022",
                                        "text": "If your willingness to trash our environment to enable your own personal comfort is an expression of love for your grandkids, then I wouldn't want to see how you express hate for them or anyone else.",
                                        "thumbs_up": "2",
                                        "thumbs_down": "2",
                                        "child": [
                                            {
                                                "name": "The Return of the Kang",
                                                "time": "April 21, 2022",
                                                "text": "I hope you have lots of tissue at hand, Mark. And before getting too preachy (a tad late perhaps), you should first get your own house in order. I see that you are using either a computer or phone to converse here, which is manufactured out of the  same base materials you rail against everyone using. No doubt you burn through your fair share of fossil fuels from petroleum to coal each year sustaining the comfort you enjoy. The Left's hypocrisy is legion in this tired argument and you are a part of that, junior.😘",
                                                "thumbs_up": "0",
                                                "thumbs_down": "0",
                                                "child": []
                                            }
                                        ]
                                    },
                                    {
                                        "name": "Jason Nichols",
                                        "time": "April 21, 2022",
                                        "text": "There's no such thing as a 'black' crime wave, it's a 'woke' crime wave.\nWoke leftists (mostly white) are using racial division to push their own agenda. Black people are victimized/killed by this more than white people.",
                                        "thumbs_up": "4",
                                        "thumbs_down": "2",
                                        "child": [
                                            {
                                                "name": "The Return of the Kang",
                                                "time": "April 21, 2022",
                                                "text": "I agree with some of that.",
                                                "thumbs_up": "2",
                                                "thumbs_down": "1",
                                                "child": []
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "name": "Alan DeVane",
                                "time": "April 21, 2022",
                                "text": "Why does everyone sit on  the same side of the church at a lefty wedding?",
                                "thumbs_up": "2",
                                "thumbs_down": "0",
                                "child": []
                            },
                            {
                                "name": "Walt Kowalski",
                                "time": "April 21, 2022",
                                "text": "We are following the science. Plenty of it out there that does not align with yours.",
                                "thumbs_up": "1",
                                "thumbs_down": "0",
                                "child": []
                            }
                        ]
                    }
                ]
            },
            {
                "name": "Taft Wellington III",
                "time": "April 21, 2022",
                "text": "That our Politicians do NOT even mention nuclear, much less Gen 4 and Gen 5 nuclear, and are NOT doing everything they can to fast track building new and more, while about 30% of our existing nuclear is being decommissioned without replacement..... WHILE China already has a Gen 4 active and building a half dozen more as we speak......PROVES the intentions of our Political elites as they drone on about \"solar and wind\".\n\nOpen your eyes you idiots.",
                "thumbs_up": "6",
                "thumbs_down": "0",
                "child": [
                    {
                        "name": "Laxman Four",
                        "time": "April 21, 2022",
                        "text": "Newer Nukes can be a big problem solver. They take massive investment and time to build and put online. The real challenge is to educate the fear out of people relative to these newer designs.",
                        "thumbs_up": "3",
                        "thumbs_down": "0",
                        "child": [
                            {
                                "name": "Taft Wellington III",
                                "time": "April 21, 2022",
                                "text": "China did it.  Are you saying we can't?  I do believe that SOME American Politicians would make it as hard as possible, but it COULD be very easy and not as long as previous, if they only wanted to.  I do believe the public has almost NO IDEA what Gen 4 and Gen 5 nuclear is and how safe it is.",
                                "thumbs_up": "1",
                                "thumbs_down": "0",
                                "child": [
                                    {
                                        "name": "Laxman Four",
                                        "time": "April 22, 2022",
                                        "text": "China does not have to worry about public opinion. We do. You spelled it out in your last sentence.",
                                        "thumbs_up": "0",
                                        "thumbs_down": "1",
                                        "child": []
                                    }
                                ]
                            },
                            {
                                "name": "Joe Easy",
                                "time": "April 21, 2022",
                                "text": "Regulations and politics make any action near impossible. Trump demonstrated what can be done if the bureaucrats get out of the way.",
                                "thumbs_up": "1",
                                "thumbs_down": "1",
                                "child": [
                                    {
                                        "name": "Taft Wellington III",
                                        "time": "April 21, 2022",
                                        "text": "See but that is simply an excuse commonly held and presented.  Politics and regulations can change with a pen stroke... if the desire was there.",
                                        "thumbs_up": "1",
                                        "thumbs_down": "0",
                                        "child": []
                                    },
                                    {
                                        "name": "Laxman Four",
                                        "time": "April 21, 2022",
                                        "text": "That's just part of the problem.",
                                        "thumbs_up": "0",
                                        "thumbs_down": "0",
                                        "child": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "name": "Dave Weinberger",
                        "time": "April 21, 2022",
                        "text": "That is unacceptable. We need to make people do things they don’t want. Climate change is about control, not the climate",
                        "thumbs_up": "4",
                        "thumbs_down": "0",
                        "child": []
                    },
                    {
                        "name": "Paul Deignan",
                        "time": "April 22, 2022",
                        "text": "Ask the Native Americans how they feel about increasing nuclear energy since production and waste depositories have been set on their land.",
                        "thumbs_up": "1",
                        "thumbs_down": "1",
                        "child": [
                            {
                                "name": "Taft Wellington III",
                                "time": "April 22, 2022",
                                "text": "Psst..... just a thought... before you reply all herky jerky like, al uninformed, perhaps read up on what Gen 4 and Gen 5 nuclear power even is and then you can make an actual comment that isn't stupid and silly.",
                                "thumbs_up": "0",
                                "thumbs_down": "0",
                                "child": [
                                    {
                                        "name": "Paul Deignan",
                                        "time": "April 22, 2022",
                                        "text": "Read up on the Pele Project, Gen 4 does have a lot of potential and I'm glad there are pilot projects into the new levels of the technology. Wounds inflicted in the past that continue to fester will take as long to heal as the waters run tainted in the scars left from previous and ongoing actions.",
                                        "thumbs_up": "1",
                                        "thumbs_down": "0",
                                        "child": [
                                            {
                                                "name": "Taft Wellington III",
                                                "time": "April 22, 2022",
                                                "text": "Good call.  I literally was reading about that a couple days ago on Defense One.",
                                                "thumbs_up": "0",
                                                "thumbs_down": "0",
                                                "child": []
                                            }
                                        ]
                                    },
                                    {
                                        "name": "Paul Deignan",
                                        "time": "April 22, 2022",
                                        "text": "Thermal reactors are nuclear reactors, even if it is only a once through. Extraction takes place on reservation land too. There are only a few gen 3s online and from what I've read, gen 5 is still purely theoretical.\nNot stupid or silly",
                                        "thumbs_up": "1",
                                        "thumbs_down": "0",
                                        "child": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "name": "Dark Zer0",
                "time": "April 22, 2022",
                "text": "Well since people are the cause of global cooling, oops I mean global warming, oops I mean climate change, oops I mean climate crisis, then we should all do our part to permanently remove every democrat.",
                "thumbs_up": "4",
                "thumbs_down": "0",
                "child": []
            },
            {
                "name": "william searle",
                "time": "April 21, 2022",
                "text": "The number one thing we can do to hold off climate change is to stop reproducing. But no one wants to admit that simple fact.",
                "thumbs_up": "3",
                "thumbs_down": "1",
                "child": [
                    {
                        "name": "edge 1452",
                        "time": "April 21, 2022",
                        "text": "Hopefully you're leading by example.",
                        "thumbs_up": "1",
                        "thumbs_down": "0",
                        "child": [
                            {
                                "name": "william searle",
                                "time": "April 21, 2022",
                                "text": "There are too many people on the planet .. -shrug-",
                                "thumbs_up": "0",
                                "thumbs_down": "0",
                                "child": []
                            }
                        ]
                    }
                ]
            },
            {
                "name": "alex tiberius",
                "time": "April 21, 2022",
                "text": "Paint all the roofs on the planet with white reflective paint and the \"problem\" is solved.",
                "thumbs_up": "1",
                "thumbs_down": "0",
                "child": []
            },
            {
                "name": "Pat Manolis",
                "time": "April 22, 2022",
                "text": "joe is constantly facing headwinds and can't tell which way the wind is blowing",
                "thumbs_up": "1",
                "thumbs_down": "0",
                "child": []
            },
            {
                "name": "edge 1452",
                "time": "April 21, 2022",
                "text": "Biden faces \"headwinds\" because he can't remember why we're celebrating Earth Day.",
                "thumbs_up": "1",
                "thumbs_down": "0",
                "child": [
                    {
                        "name": "Patrick Rowe",
                        "time": "April 21, 2022",
                        "text": "Everyone’s entitled to act stupid once in a while, but you really abuse the privilege.",
                        "thumbs_up": "0",
                        "thumbs_down": "1",
                        "child": [
                            {
                                "name": "edge 1452",
                                "time": "April 21, 2022",
                                "text": "🤣🤣🤣",
                                "thumbs_up": "1",
                                "thumbs_down": "0",
                                "child": []
                            }
                        ]
                    }
                ]
            },
            {
                "name": "mikal murphy",
                "time": "April 21, 2022",
                "text": "Oh I was waiting for it’s Joe Manchin’s fault..Biden made promises that he had little chance of getting climate done. And the far lefts push to shove it down Americas throat didn’t help. Joe Manhin sent a letter to Chuck Schumer in July of 2021 saying he would not support a bill that exceeded 1.5 Trillion dollars, Chuck Schumer hid that letter from Pelosi or anyone else who should have known of Manchin’s stance. Schumer thought he could shame Manchin into voting for the larger package, it didn’t work. So blame Joe Manchin all you want, you get nothing. There is still a chance to get something done. Actually the White House stopped talking about Manchin in an attempt to finally get a deal done. It’s time to stop whining about Manchin and work with him. Right now the left has become victims of Joe Manchin.",
                "thumbs_up": "1",
                "thumbs_down": "1",
                "child": []
            },
            {
                "name": "Suzanne Toncar",
                "time": "April 23, 2022",
                "text": "For a president who is allegedly so concerned about global warming/climate change, why is he flying across the country to address global warming/climate change?  He is probably okay with his climate czar the haughty John Kerry flying around the world in a private jet, you know he's sooo important that his comfort is more important than his carbon footprint..",
                "thumbs_up": "1",
                "thumbs_down": "0",
                "child": []
            },
            {
                "name": "dennis Ketty",
                "time": "April 21, 2022",
                "text": "Biden's climate agenda is killing Ukrainian's.",
                "thumbs_up": "6",
                "thumbs_down": "2",
                "child": []
            },
            {
                "name": "Frank Sterle",
                "time": "April 22, 2022",
                "text": "At least Biden seems to truly care. Many mainstream-news-media CEOs, and even senior editors, are unfazed by manmade global warming and its resultant extreme weather events.\n\nI can readily recall the unsigned editorial that a local newspaper, The Surrey Now-Leader, printed just before Earth Day 2017, titled “Earth Day in need of a facelift”. Varied lengths of the same editorial, unfortunately, was also run by some sister newspapers, all owned by the same news-media mogul who also happens to be an aspiring oil refiner.\n \nIt opined that “some people would argue that [the day of environmental action] … is an anachronism,” that it should instead be a day of recognizing what we’ve societally accomplished. “And while it [has] served us well, in 2017, do we really need Earth Day anymore?” \n \nUntil reading this, I had never heard anyone, let alone a mainstream news outlet, suggest we’re doing so well as to render Earth Day an unnecessary \"anachronism”. Considering the sorry state of the planet’s natural environment, I still find it one of the most absurd and irresponsible acts of editorial journalism I've witnessed in my 35 years of news consumption.",
                "thumbs_up": "0",
                "thumbs_down": "0",
                "child": []
            },
            {
                "name": "Tom A. Hawk",
                "time": "April 22, 2022",
                "text": "Biden has failed on every single policy.  \n\nBut hey, at least the left-handed dwarf with eleven fingers and the pink Corvair got a cabinet job.  Who said experience was important anyways?",
                "thumbs_up": "1",
                "thumbs_down": "0",
                "child": []
            },
            {
                "name": "Suzanne Toncar",
                "time": "April 22, 2022",
                "text": "I think he thinks he is going to Seattle to celebrates the Earth's birthday and will get ice cream......",
                "thumbs_up": "1",
                "thumbs_down": "0",
                "child": []
            },
            {
                "name": "Tom Bigley",
                "time": "April 22, 2022",
                "text": "Trees need carbon dioxide. There are 380 trees for every single man, woman and child on earth. Let the trees breathe for all love!",
                "thumbs_up": "0",
                "thumbs_down": "0",
                "child": []
            },
            {
                "name": "Franklin Cain",
                "time": "April 22, 2022",
                "text": "Our senile old incompetent buffoon has to have both feet over the fence on this one-now that he has been forced to realize the world and USA runs on oil, not solar and wind and EV's.  He should be asked why all our national reserve oil is going to the EU - because they will gladly pay higher prices than US consumers - the real story not being told or investigated.  Those are our national reserves-not to be sold on open market by incompetent Democrats.",
                "thumbs_up": "1",
                "thumbs_down": "0",
                "child": []
            },
            {
                "name": "D Steele",
                "time": "April 22, 2022",
                "text": "Every American president has talked and talked until they got in office then pretty much shut up and did zero to address anything. The US system is designed so no one has any real power . The US has pushed cars down our throats and made citizens spend trillions while polluting the earth with a smile on your face .",
                "thumbs_up": "0",
                "thumbs_down": "0",
                "child": [
                    {
                        "name": "guillermo piedras",
                        "time": "April 22, 2022",
                        "text": "I’ll take cars over mass transit any day.",
                        "thumbs_up": "3",
                        "thumbs_down": "0",
                        "child": [
                            {
                                "name": "Suzanne Toncar",
                                "time": "April 22, 2022",
                                "text": "Agree - someone needs to tell these mask-wearing Biden supporters driving alone in their cars that they are not riding in mass-transit vehicles......I will keep my maskless face driving my own vehicle, thank you very much!",
                                "thumbs_up": "3",
                                "thumbs_down": "0",
                                "child": []
                            }
                        ]
                    }
                ]
            },
            {
                "name": "gail M Braxton",
                "time": "April 21, 2022",
                "text": "While American is experiencing extreme weather over and over this year, fires and flooding will continue to happen......the naysayers and Trump supporters from Climate Change to Covid-19 have no where to turn, they will be eating crow.",
                "thumbs_up": "3",
                "thumbs_down": "21",
                "child": [
                    {
                        "name": "Texas Pete",
                        "time": "April 21, 2022",
                        "text": "I keep hearing about \"extreme weather\" however the weather patterns I see today have been constant all my life.  What's different is how it's is reported.  Weather, even large events, used to be local or regional news. Now it's national news and it's reported as extraordinary events.",
                        "thumbs_up": "15",
                        "thumbs_down": "4",
                        "child": [
                            {
                                "name": "Mark Adkins",
                                "time": "April 21, 2022",
                                "text": "Record heat for several succeeding years now rules out the \"constant weather patterns.\" But our own time left on earth is short, so who cares that we're leaving our grandkids a ruined planet, eh?",
                                "thumbs_up": "1",
                                "thumbs_down": "10",
                                "child": [
                                    {
                                        "name": "PurpleTurtle",
                                        "time": "April 21, 2022",
                                        "text": "We haven't broke 100 for years during the summer. Today they like to use \"heat index numbers\" to make it look worse.",
                                        "thumbs_up": "9",
                                        "thumbs_down": "3",
                                        "child": []
                                    },
                                    {
                                        "name": "Texas Pete",
                                        "time": "April 21, 2022",
                                        "text": "Lol..... Every year a record is broken because an average temp for an eon hasn't been recorded by mankind.  Nothing has been ruined and even if it were there's no evidence it's man-made or reversible by mankind.",
                                        "thumbs_up": "4",
                                        "thumbs_down": "1",
                                        "child": [
                                            {
                                                "name": "Mark Adkins",
                                                "time": "April 21, 2022",
                                                "text": "Yeah, I'll chalk up your reply as \"famous last words.\" And I'll pray for your grandkids, over the environmental mess that we're leaving them, since you evidently don't care about either the environment or your grandkids.",
                                                "thumbs_up": "2",
                                                "thumbs_down": "2",
                                                "child": [
                                                    {
                                                        "name": "Texas Pete",
                                                        "time": "April 22, 2022",
                                                        "text": "I'm not easily fooled.  I know a snow job when I see one.  So the earth is getting warmer there's no evidence it's our fault and there's especially no evidence man can reverse it.",
                                                        "thumbs_up": "1",
                                                        "thumbs_down": "0",
                                                        "child": [
                                                            {
                                                                "name": "Mark Adkins",
                                                                "time": "April 22, 2022",
                                                                "text": "So, you, a guy in Texas, simply poo-poo on the possibility that the planet's human population...all 7.9 billion of us...is causing climate change. What a shocker...not. Rest assured, plenty of smart people claim that there is indeed lots of evidence proving that climate-change is caused by humans. That said, I hope that you realize that with such a possibility...that humans are causing climate change...looming over us, we have the choice of either adequately addressing the problem, or going about our merry way, living our lives as usual. Even without climate change being factored in, the destruction that this society is inflicting to the landscape, fueled by a short-sighted mentality of \"I want everything, including all of our natural resources, right now, to provide me with as much comfort and luxury as is possible!!!\" will leave your and my grandkids with a highly diminished life, and a landscape overpopulated with humans of every sort. And conservative s still seem to care little about such a country that we're leaving our posterity. Very troubling, to say the least.",
                                                                "thumbs_up": "0",
                                                                "thumbs_down": "1",
                                                                "child": [
                                                                    {
                                                                        "name": "Texas Pete",
                                                                        "time": "April 23, 2022",
                                                                        "text": "The sky is not falling chicken little.",
                                                                        "thumbs_up": "1",
                                                                        "thumbs_down": "0",
                                                                        "child": []
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "name": "Mike Steaphens",
                        "time": "April 21, 2022",
                        "text": "The sky is not falling there, chicken little.",
                        "thumbs_up": "16",
                        "thumbs_down": "2",
                        "child": []
                    },
                    {
                        "name": "American Patriot",
                        "time": "April 22, 2022",
                        "text": "The satanic left weaponized the NEWS OF THE WEATHER.",
                        "thumbs_up": "0",
                        "thumbs_down": "0",
                        "child": []
                    }
                ]
            },
            {
                "name": "udi BEHR",
                "time": "April 21, 2022",
                "text": "Where is the BBB plan ? Biden good old man weak president.  We need a new face for 2024 , the sooner the better.",
                "thumbs_up": "2",
                "thumbs_down": "3",
                "child": [
                    {
                        "name": "Dan Brown",
                        "time": "April 21, 2022",
                        "text": "Good old man? Ha! Possibly the crookedest President in history.",
                        "thumbs_up": "6",
                        "thumbs_down": "1",
                        "child": []
                    }
                ]
            },
            {
                "name": "American Patriot",
                "time": "April 21, 2022",
                "text": "Three negative Biden hit pieces in one day here…wow\nFirst time in history",
                "thumbs_up": "1",
                "thumbs_down": "0",
                "child": [
                    {
                        "name": "Topper Harley",
                        "time": "April 21, 2022",
                        "text": "He’s outlived his usefulness.",
                        "thumbs_up": "4",
                        "thumbs_down": "0",
                        "child": [
                            {
                                "name": "American Patriot",
                                "time": "April 21, 2022",
                                "text": "So it appears \nThe writing is on the wall and they  must have him removed by any means necessary asap",
                                "thumbs_up": "2",
                                "thumbs_down": "0",
                                "child": [
                                    {
                                        "name": "Topper Harley",
                                        "time": "April 21, 2022",
                                        "text": "Harris is his impeachment insurance. Whether Biden stays or goes, it won’t end well for any of us.",
                                        "thumbs_up": "3",
                                        "thumbs_down": "0",
                                        "child": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "name": "Kathy Perrine",
                "time": "April 21, 2022",
                "text": "Is anyone else having difficulty with comments feature?  I can access it thru my phone but not on my laptop. Any advice?  Thank you",
                "thumbs_up": "0",
                "thumbs_down": "0",
                "child": []
            },
            {
                "name": "Dan Brown",
                "time": "April 21, 2022",
                "text": "Oh NO! Biden is having trouble getting to waste billions and billions on useless, pointless \"green\" crap that isn't green. How sad for him. Well, not for him. He has no clue about what's actually going on in the world. His dementia is that bad now.",
                "thumbs_up": "0",
                "thumbs_down": "0",
                "child": []
            },
            {
                "name": "billy smith",
                "time": "April 22, 2022",
                "text": "https://www.dailymail.co.uk/news/article-10739931/Biden-insists-not-considering-delaying-lifting-Title-42.html#comments-10739931",
                "thumbs_up": "0",
                "thumbs_down": "0",
                "child": []
            },
            {
                "name": "billy smith",
                "time": "April 22, 2022",
                "text": "https://www.americanthinker.com/articles/2022/04/the_real_reset_is_coming_but_not_the_one_the_elites_expect.html",
                "thumbs_up": "0",
                "thumbs_down": "0",
                "child": []
            }
        ]
    }
]